EZ32Inc/esp32jtag_firmware/main/network/web_server.c
        if (end_of_data_pos) {
            bytes_to_write = end_of_data_pos - buf -2; //-2 to remove "\r\n" before final_boundary
            memcpy(psram_buffer+total_wr, buf, bytes_to_write);
            total_wr += bytes_to_write;
            ESP_LOGI("FPGA_LOADER_bb", "Found end boundary, writing final %d bytes read_bytes=%d ", bytes_to_write, read_bytes);
            remaining -= read_bytes;
            received_bytes += read_bytes;
            break;
        }
        else{
            bytes_to_write = read_bytes;
            memcpy(psram_buffer+total_wr, buf, bytes_to_write);
            total_wr += read_bytes;
        }

        remaining -= read_bytes;
        received_bytes += read_bytes;
    }
    
    ESP_LOGI("FPGA_LOADER", "last time: read_bytes=%d total_wr=%d", read_bytes, total_wr);
#if 0
    //for(int i =0;i<read_bytes; ++i){
    //    ESP_LOGI(TAG, "%02x ",buf[i]);
    //    if(i+6<read_bytes && buf[i] == 0x2d && buf[i+1] == 0x2d && buf[i+2] == 0x2d && buf[i+3] == 0x2d && buf[i+4] == 0x2d && buf[i+5] == 0x2d)
    //        ESP_LOGI("FPGA_LOADER", "Found end boundary");
    //}

    //char *end_of_data_pos = strstr(buf, "\x2d\x2d\x2d\x2d\x2d\x2d");
    char *end_of_data_pos = NULL;
    for (int i = 0; i <= read_bytes - final_boundary_len; ++i) {
        if (memcmp(buf + i, final_boundary, final_boundary_len ) == 0) {
            end_of_data_pos = buf + i;
            ESP_LOGI("FPGA_LOADER_c1", "Found end boundary");
            break;
        }
    }

    if (end_of_data_pos) {
        ESP_LOGI("FPGA_LOADER_c2", "Found end boundary");
    }
    else{
        ESP_LOGI("FPGA_LOADER_c2", "Not Found end boundary");
    }
#endif
    ESP_LOGI("FPGA_LOADER", "Finished receiving FPGA bin file, total size: %d total_wr=%d", received_bytes, total_wr);
    
    extern spi_device_handle_t gbl_spi_h1;

    if (spi_device_acquire_bus(gbl_spi_h1, portMAX_DELAY) != ESP_OK) {
        ESP_LOGE("FPGA_LOADER", "Failed to acquire SPI bus");
    //    vTaskDelay(pdMS_TO_TICKS(100));
    }
    else{
#if 1
/*
        extern const unsigned char bitstream_bin_start[] asm("_binary_bitstream_bin_start");
        extern const unsigned char bitstream_bin_end[]   asm("_binary_bitstream_bin_end");
        //const size_t sz = (bitstream_bin_end - bitstream_bin_start);
        //uint8_t cfg_stat = ICE_FPGA_Config(bitstream_bin_start, sz);

        //debug
        int i = 0;
        for(i =0;i<total_wr;++i){
            if(psram_buffer[i] != bitstream_bin_start[i]){
                ESP_LOGE("FPGA_LOADER", "data is different!!! i=%d 0x%02x vs  %02x",i, psram_buffer[i], bitstream_bin_start[i]);
                break;
            }
        }

        if(i == total_wr){
            ESP_LOGW("FPGA_LOADER", "data is the same!");
        }
*/
       // memcpy(psram_buffer, bitstream_bin_start,total_wr);

        uint8_t cfg_stat = ICE_FPGA_Config(psram_buffer, total_wr);
        // Send success response
        if(cfg_stat)
#else
       extern esp_err_t load_fpga(void);
       if(ESP_OK != load_fpga())
#endif
            httpd_resp_sendstr(req, "FPGA CFG Failed");
        else
            httpd_resp_sendstr(req, "FPGA CFG successful");
    }

    // Release the SPI bus after the transaction is done
    spi_device_release_bus(gbl_spi_h1);

    free(buf);
    return ESP_OK;
}
#endif //#ifdef FPGA_CFG_TEST 

#ifndef FPGA_CFG_TEST 
static esp_err_t ota_upload_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    esp_ota_handle_t ota_handle;
    const esp_partition_t *update_partition = esp_ota_get_next_update_partition(NULL);
    esp_err_t err;

    if (!update_partition) {
        ESP_LOGE(TAG, "No OTA partition found");
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "No OTA partition found");
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "Starting OTA on partition: %s", update_partition->label);

    err = esp_ota_begin(update_partition, OTA_WITH_SEQUENTIAL_WRITES, &ota_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_ota_begin failed (%s)", esp_err_to_name(err));
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA begin failed");
        return ESP_FAIL;
    }

    char *buf = (char *)malloc(4096);
    if (buf == NULL) {
        ESP_LOGE(TAG, "Failed to allocate memory for buffer");
        esp_ota_abort(ota_handle);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Memory allocation failed");
        return ESP_FAIL;
    }

    // Get the boundary from the header
    size_t len = httpd_req_get_hdr_value_len(req, "Content-Type");
    if (len == 0) {
        ESP_LOGE(TAG, "Content-Type header not found");
        free(buf);
        esp_ota_abort(ota_handle);
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Content-Type header not found");
        return ESP_FAIL;
    }
    char *ctype_hdr = (char *)malloc(len + 1);
    if (ctype_hdr == NULL) {
        ESP_LOGE(TAG, "Failed to allocate memory for ctype header");
        free(buf);
        esp_ota_abort(ota_handle);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Memory allocation failed");
        return ESP_FAIL;
    }
    httpd_req_get_hdr_value_str(req, "Content-Type", ctype_hdr, len + 1);

    char *boundary_str = strstr(ctype_hdr, "boundary=");
    if (boundary_str == NULL) {
        ESP_LOGE(TAG, "Boundary not found in Content-Type header");
        free(buf);
        free(ctype_hdr);
        esp_ota_abort(ota_handle);
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Boundary not found");
        return ESP_FAIL;
    }

    boundary_str += strlen("boundary=");
    char boundary_line[128];
    snprintf(boundary_line, sizeof(boundary_line), "--%s", boundary_str);
    int boundary_len = strlen(boundary_line);
    free(ctype_hdr);

    int data_read;
    int total_len = 0;
    bool found_firmware = false;
    
    // Read the entire request body to find the firmware data
    while ((data_read = httpd_req_recv(req, buf, 4096)) > 0) {
        if (!found_firmware) {
            // Check for the boundary line that precedes the file data
            char *firmware_start = NULL;
            // Since we are looking for string in the header part (text), strstr is okay for looking for boundary start
            // BUT, to be consistent and safe, let's use memcmp as well if we were searching largely.
            // However, the header part IS text. The boundary itself is text.
            // The issue is if null bytes appear BEFORE the start boundary (unlikely in HTTP multipart)
            // or if we rely on strstr to find \r\n\r\n

            // Search for boundary line
            for (int i = 0; i <= data_read - boundary_len; i++) {
                if (memcmp(buf + i, boundary_line, boundary_len) == 0) {
                     firmware_start = buf + i;
                     break;
                }
            }

            if (firmware_start != NULL) {
                // Find the double CRLF following the boundary to determine start of data
                char *data_start = NULL;
                // Start searching from where boundary was found
                int search_start_idx = firmware_start - buf;

                // We need to find \r\n\r\n.
                // Note: The multipart header can be larger.

