EZ32Inc/esp32jtag_firmware/main/network/web_server.c
                for (int i = search_start_idx; i <= data_read - 4; i++) {
                     if (memcmp(buf + i, "\r\n\r\n", 4) == 0) {
                         data_start = buf + i + 4;
                         break;
                     }
                }

                if (data_start != NULL) {
                    found_firmware = true;
                    int header_len = data_start - buf;
                    int data_len_in_buf = data_read - header_len;

                    err = esp_ota_write(ota_handle, data_start, data_len_in_buf);
                    if (err != ESP_OK) {
                        ESP_LOGE(TAG, "esp_ota_write failed (%s)", esp_err_to_name(err));
                        free(buf);
                        esp_ota_abort(ota_handle);
                        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA write failed");
                        return ESP_FAIL;
                    }
                    total_len += data_len_in_buf;
                }
            }
        } else {
            // Search for the end boundary in the current chunk
            char *end_boundary = NULL;
             for (int i = 0; i <= data_read - boundary_len; i++) {
                if (memcmp(buf + i, boundary_line, boundary_len) == 0) {
                     end_boundary = buf + i;
                     break;
                }
            }

            if (end_boundary != NULL) {
                // We've found the end of the file, write the remaining data
                // The data ends before (end_boundary - 2) which is the \r\n before header
                int final_len = end_boundary - buf - 2;

                // Sanity check
                if (final_len < 0) final_len = 0; // Should not happen if protocol obeyed

                err = esp_ota_write(ota_handle, buf, final_len);
                if (err != ESP_OK) {
                    ESP_LOGE(TAG, "esp_ota_write failed (%s)", esp_err_to_name(err));
                    free(buf);
                    esp_ota_abort(ota_handle);
                    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA write failed");
                    return ESP_FAIL;
                }
                total_len += final_len;
                break;
            } else {
                // Regular data chunk
                err = esp_ota_write(ota_handle, buf, data_read);
                if (err != ESP_OK) {
                    ESP_LOGE(TAG, "esp_ota_write failed (%s)", esp_err_to_name(err));
                    free(buf);
                    esp_ota_abort(ota_handle);
                    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA write failed");
                    return ESP_FAIL;
                }
                total_len += data_read;
            }
        }
    }
    free(buf);
    
    ESP_LOGI(TAG, "Finished receiving OTA image, total size: %d", total_len);
    err = esp_ota_end(ota_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_ota_end failed (%s)", esp_err_to_name(err));
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA end failed");
        return ESP_FAIL;
    }

    err = esp_ota_set_boot_partition(update_partition);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_ota_set_boot_partition failed (%s)", esp_err_to_name(err));
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to set boot partition");
        return ESP_FAIL;
    }

    // Send a success response
    const char *resp = "OTA Update Successful! Rebooting...";
    httpd_resp_sendstr(req, resp);

    // Reboot the device after a short delay
    vTaskDelay(pdMS_TO_TICKS(2000));
    esp_restart();

    return ESP_OK;
}
#endif


static char* get_cjson_string(cJSON *item)
{
    if (!item) {
        return NULL;
    }
    if (cJSON_IsString(item)) {
        return item->valuestring;
    }
    if (cJSON_IsNumber(item)) {
        static char num_str[32]; // Not thread safe, but acceptable here
        snprintf(num_str, sizeof(num_str), "%d", item->valueint);
        return num_str;
    }
    return NULL;
}

esp_err_t set_credentials_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    char *json = malloc(req->content_len + 1); // +1 for null terminator
    if (!json) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Memory allocation failed");
        return ESP_FAIL;
    }

    cJSON *root = set_handler_start(req, json, req->content_len + 1);
    free(json); // Free buffer as root now holds the data

    if (!root) return ESP_FAIL;

    cJSON *pacfg = cJSON_GetObjectItem(root, "pacfg");
    cJSON *pbcfg = cJSON_GetObjectItem(root, "pbcfg");
    cJSON *pccfg = cJSON_GetObjectItem(root, "pccfg");
    cJSON *pdcfg = cJSON_GetObjectItem(root, "pdcfg");
    cJSON *targetVoltage = cJSON_GetObjectItem(root, "targetVoltage");
    cJSON *swMcu = cJSON_GetObjectItem(root, "swMcu");
    cJSON *wifiMode = cJSON_GetObjectItem(root, "wifiMode");
    cJSON *ssid = cJSON_GetObjectItem(root, "ssid");
    cJSON *pass = cJSON_GetObjectItem(root, "password");
    cJSON *otaUrl = cJSON_GetObjectItem(root, "otaUrl");
    cJSON *mcuInterface = cJSON_GetObjectItem(root, "mcuInterface");

    cJSON *uartBaud = cJSON_GetObjectItem(root, "uartBaud");
    cJSON *uartDataBits = cJSON_GetObjectItem(root, "uartDataBits");
    cJSON *uartStopBits = cJSON_GetObjectItem(root, "uartStopBits");
    cJSON *uartParity = cJSON_GetObjectItem(root, "uartParity");

    cJSON *uartPortSel = cJSON_GetObjectItem(root, "uartPortSel");
    cJSON *disableUsbDapCom = cJSON_GetObjectItem(root, "disableUsbDapCom");

    char *ssid_str = get_cjson_string(ssid);
    char *pass_str = get_cjson_string(pass);

    // if (!ssid_str || !pass_str) {
    //     cJSON_Delete(root);
    //     httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Json parse error: missing SSID or Password");
    //     return ESP_FAIL;
    // }

    char *pacfg_str = get_cjson_string(pacfg);
    if(pacfg_str && strcmp(pacfg_str, "1") == 0) {
        // Force to Logic Analyzer (0) if SWD/JTAG (1) is requested
        pacfg_str = "0";
    }
    char *pbcfg_str = get_cjson_string(pbcfg);
    char *pccfg_str = get_cjson_string(pccfg);
    char *pdcfg_str = get_cjson_string(pdcfg);
    char *targetVoltage_str = get_cjson_string(targetVoltage);
    char *swMcu_str = get_cjson_string(swMcu);
    char *wifiMode_str = get_cjson_string(wifiMode);
    char *otaUrl_str = get_cjson_string(otaUrl);
    char *mcuInterface_str = get_cjson_string(mcuInterface);

    char *uartBaud_str = get_cjson_string(uartBaud);
    char *uartDataBits_str = get_cjson_string(uartDataBits);
    char *uartStopBits_str = get_cjson_string(uartStopBits);
    char *uartParity_str = get_cjson_string(uartParity);
    char *uartPortSel_str = get_cjson_string(uartPortSel);
    bool disableUsbDapCom_val = false;
    if (disableUsbDapCom && cJSON_IsTrue(disableUsbDapCom)) {
        disableUsbDapCom_val = true;
    }

    // Log the received values (placeholder for actual logic)
    if (pacfg_str) ESP_LOGI(TAG, "Port A Config: %s", get_port_a_description(pacfg_str));
    if (pbcfg_str) ESP_LOGI(TAG, "Port B Config: %s", get_port_b_description(pbcfg_str));
    if (pccfg_str) ESP_LOGI(TAG, "Port C Config: %s", get_port_c_description(pccfg_str));
    if (pdcfg_str) ESP_LOGI(TAG, "Port D Config: %s", get_port_d_description(pdcfg_str));
    if (targetVoltage_str) ESP_LOGI(TAG, "Target IO Voltage: %s", get_target_voltage_description(targetVoltage_str));
    if (swMcu_str) ESP_LOGI(TAG, "Software for MCU Debug: %s", get_sw_mcu_description(swMcu_str));
    if (wifiMode_str) ESP_LOGI(TAG, "WiFi Mode: %s", get_wifi_mode_description(wifiMode_str));
    if (otaUrl_str) ESP_LOGI(TAG, "OTA URL: %s", otaUrl_str);
    if (mcuInterface_str) ESP_LOGI(TAG, "MCU Interface: %s", mcuInterface_str);

    if (uartBaud_str) ESP_LOGI(TAG, "UART Baud: %s", uartBaud_str);
    if (uartDataBits_str) ESP_LOGI(TAG, "UART Data Bits: %s", uartDataBits_str);
    if (uartStopBits_str) ESP_LOGI(TAG, "UART Stop Bits: %s", uartStopBits_str);
    if (uartParity_str) ESP_LOGI(TAG, "UART Parity: %s", uartParity_str);
    if (uartPortSel_str) ESP_LOGI(TAG, "UART Port Sel: %s", uartPortSel_str);
    if (disableUsbDapCom) ESP_LOGI(TAG, "Disable USB DAP: %d", disableUsbDapCom_val);

    if (ssid_str) ESP_LOGI(TAG, "SSID: %s", ssid_str);
    // For security, avoid logging password in plain text in production.
    if (pass_str) ESP_LOGI(TAG, "Password received (for demonstration)");

    // Check if critical Wi-Fi settings have changed
    bool reboot_required = false;
    char *stored_val = NULL;

    // Check Wi-Fi Mode
    bool wifi_changed = false;
    if (wifiMode_str) {
        // Check if runtime mode differs from requested mode (e.g. forced AP fallback vs requested SM)
        bool runtime_mismatch = false;
        if (strcmp(wifiMode_str, "SM") == 0 && g_app_params.mode != APP_MODE_STA) runtime_mismatch = true;
        if (strcmp(wifiMode_str, "AP") == 0 && g_app_params.mode != APP_MODE_AP) runtime_mismatch = true;

        if (storage_alloc_and_read(WIFI_MODE_KEY, &stored_val) == ESP_OK && stored_val) {
            if (strcmp(stored_val, wifiMode_str) != 0 || runtime_mismatch) {
                wifi_changed = true;
                reboot_required = true;
                ESP_LOGI(TAG, "WiFi Mode changed or mismatch: stored=%s, req=%s, runtime_mismatch=%d", stored_val, wifiMode_str, runtime_mismatch);
            }
            free(stored_val); stored_val = NULL;
        } else {
            // No stored value but new value provided implies change (or first set)
            wifi_changed = true;
            reboot_required = true;
        }
    }

