EZ32Inc/esp32jtag_firmware/main/network/web_server.c
    cJSON_Delete(root);

    if (reboot_required) {
        httpd_resp_sendstr(req, "Critical settings changed. Rebooting...");
        vTaskDelay(2000 / portTICK_PERIOD_MS);
        esp_restart();
    } else {
        httpd_resp_sendstr(req, "Settings saved.");
        void set_cfg_after_settings_change(void);
        set_cfg_after_settings_change();
    }

    return ESP_OK;
}

void set_cfg_after_settings_change(void)
{
    ESP_LOGI(TAG, "Configuration updated. Applying changes without reboot...");
    // TODO: Implement dynamic configuration update logic here
}

esp_err_t get_credentials_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    cJSON *root = cJSON_CreateObject();
    char *val = NULL;

    // --- Port Configs ---
    if (storage_alloc_and_read(PORT_A_CFG_KEY, &val) == ESP_OK && val) {
        if(strcmp(val, "1") == 0) {
            cJSON_AddStringToObject(root, "pacfg", "0");
        } else {
            cJSON_AddStringToObject(root, "pacfg", val);
        }
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "pacfg", "0"); // Default
    }

    if (storage_alloc_and_read(PORT_B_CFG_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "pbcfg", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "pbcfg", "0");
    }

    if (storage_alloc_and_read(PORT_C_CFG_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "pccfg", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "pccfg", "0");
    }

    if (storage_alloc_and_read(PORT_D_CFG_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "pdcfg", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "pdcfg", "0");
    }

    // --- Other Settings ---
    if (storage_alloc_and_read(TARGET_VOLTAGE_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "targetVoltage", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "targetVoltage", "0");
    }

    if (storage_alloc_and_read(SW_MCU_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "swMcu", val);
        free(val); val = NULL;
    } else {
         cJSON_AddStringToObject(root, "swMcu", "0");
    }

    // --- WiFi ---
    // Station Mode SSID
    char *ssid_st = NULL;
    if (storage_alloc_and_read(WIFI_SSID_KEY, &ssid_st) == ESP_OK && ssid_st) {
        cJSON_AddStringToObject(root, "ssid_st", ssid_st);
    } else {
        cJSON_AddStringToObject(root, "ssid_st", "");
    }

    // AP Mode SSID
    char *ssid_ap = NULL;
    if (storage_alloc_and_read(WIFI_AP_SSID_KEY, &ssid_ap) == ESP_OK && ssid_ap) {
        cJSON_AddStringToObject(root, "ssid_ap", ssid_ap);
    } else {
        cJSON_AddStringToObject(root, "ssid_ap", ""); // Or default WIFI_AP_SSSID if we want to show default
    }

    // Populate generic 'ssid' for backward compatibility / initial view
    if (g_app_params.mode == APP_MODE_STA) {
        cJSON_AddStringToObject(root, "ssid", ssid_st ? ssid_st : "");
    } else {
        // If AP custom ssid exists, use it, else default
        if (ssid_ap) {
            cJSON_AddStringToObject(root, "ssid", ssid_ap);
        } else {
            cJSON_AddStringToObject(root, "ssid", WIFI_AP_SSSID);
        }
    }

    if (ssid_st) free(ssid_st);
    if (ssid_ap) free(ssid_ap);
     // Don't send password back
    cJSON_AddStringToObject(root, "password", "");

    // Use runtime mode to reflect actual status
    if (g_app_params.mode == APP_MODE_STA) {
        cJSON_AddStringToObject(root, "wifiMode", "SM");
    } else {
        cJSON_AddStringToObject(root, "wifiMode", "AP");
    }
    // Note: We intentionally ignore the stored WIFI_MODE_KEY here to avoid
    // discrepancies when fallback logic forces AP mode but NVS still has "SM".

    if (storage_alloc_and_read(OTA_URL_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "otaUrl", val);
        free(val); val = NULL;
    } else {
         cJSON_AddStringToObject(root, "otaUrl", "");
    }

    // Fixed values: MCU interface is always GPIO, UART always Web Terminal
    cJSON_AddStringToObject(root, "mcuInterface", "GPIO");
    cJSON_AddStringToObject(root, "uartPortSel", "1");

    // --- UART Settings ---
    if (storage_alloc_and_read(UART_BAUD_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "uartBaud", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "uartBaud", "115200");
    }

    if (storage_alloc_and_read(UART_DATA_BITS_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "uartDataBits", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "uartDataBits", "8");
    }

    if (storage_alloc_and_read(UART_STOP_BITS_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "uartStopBits", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "uartStopBits", "1");
    }

    if (storage_alloc_and_read(UART_PARITY_KEY, &val) == ESP_OK && val) {
        cJSON_AddStringToObject(root, "uartParity", val);
        free(val); val = NULL;
    } else {
        cJSON_AddStringToObject(root, "uartParity", "n"); // 'n' for None
    }

    // Fixed value: USB DAP/COM is always disabled
    cJSON_AddBoolToObject(root, "disableUsbDapCom", true);

    const char *sys_info = cJSON_PrintUnformatted(root);
    httpd_resp_sendstr(req, sys_info);

    free((void *)sys_info);
    cJSON_Delete(root);

    return ESP_OK;
}


static void get_filename_from_path(const char *path, char *filename, size_t filename_len)
{
    const char *last_slash = strrchr(path, '/');
    const char *src = last_slash ? last_slash + 1 : path;
    strncpy(filename, src, filename_len - 1);
    filename[filename_len - 1] = '\0';
}

static esp_err_t file_upload_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;

    struct stat file_stat;
    char filepath[128] = CFG_FILE_PATH;
    size_t prefix_len = strlen(CFG_FILE_PATH);

    get_filename_from_path(req->uri, filepath + prefix_len, sizeof(filepath) - prefix_len);

    if (stat(filepath, &file_stat) == 0) {
        ESP_LOGE(TAG, "File already exists : %s", filepath);
        /* Respond with 400 Bad Request */
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "File already exists!");
        return ESP_FAIL;
    }

    // Open the file for writing
    FILE *fp = fopen(filepath, "w");
    if (fp == NULL) {
        ESP_LOGE(TAG, "Failed to open file for writing");
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to open file");
        return ESP_FAIL;
    }

    char buf[1024];
    size_t remaining = req->content_len;
    const uint8_t poll_period = 10; /* ms */
    uint16_t try_count = 1000 / poll_period; /* 1 second timeout */

    while (try_count) {

        ESP_LOGI(TAG, "Remaining size : %d", remaining);

        // Read a chunk of data from the request
        int received = httpd_req_recv(req, buf, MIN(remaining, sizeof(buf)));
        if (received <= 0) {
            if (received == HTTPD_SOCK_ERR_TIMEOUT) {
                /* Retry if timeout occurred */
                continue;
            }

            /* In case of unrecoverable error, close and delete the unfinished file*/
            fclose(fp);
            unlink(filepath);

            ESP_LOGE(TAG, "File reception failed!");
            /* Respond with 500 Internal Server Error */
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to receive file");
            return ESP_FAIL;
        }

        /* Write buffer content to file on storage */
        if (received != fwrite(buf, 1, received, fp)) {
            /* Couldn't write everything to file! Storage may be full? */
            fclose(fp);
            unlink(filepath);

            ESP_LOGE(TAG, "File write failed!");
            /* Respond with 500 Internal Server Error */
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to write file to storage");
            return ESP_FAIL;
        }

