EZ32Inc/esp32jtag_firmware/main/network/web_server.c
        /* Keep track of remaining size of the file left to be uploaded */
        remaining -= received;
        if (!remaining) {
            break;
        }

        /* If still there is remaining data, something might be wrong. */
        try_count--;
        vTaskDelay(pdMS_TO_TICKS(poll_period));
    }

    // Close the file
    fclose(fp);
    ESP_LOGI(TAG, "File received: %s", filepath);

    storage_update_target_struct();

    // Send the response indicating success
    httpd_resp_sendstr(req, "File uploaded successfully");

    return ESP_OK;
}

static esp_err_t file_delete_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    char filepath[128] = {0};
    char filename[64] = {0};

    get_filename_from_path(req->uri, filename, sizeof(filename));

    snprintf(filepath, sizeof(filepath), "%s%s", CFG_FILE_PATH, filename);

    ESP_LOGI(TAG, "filepath:%s", filepath);

    struct stat file_stat;

    if (stat(filepath, &file_stat) != 0) {
        ESP_LOGE(TAG, "File not exists : %s", filepath);
        /* Respond with 400 Bad Request */
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "File not exists!");
        return ESP_FAIL;
    }

    unlink(filepath);

    storage_update_target_struct();

    // Send the response indicating success
    httpd_resp_sendstr(req, "File deleted successfully");

    return ESP_OK;
}
#if 0
static esp_err_t logic_analyzer_data_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    char query_str[64];
    if (httpd_req_get_url_query_str(req, query_str, sizeof(query_str)) != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get query string");
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Missing query parameters");
        return ESP_FAIL;
    }

    int num_channels = 0;
    int num_samples = 0;
    
    char param[32];
    if (httpd_query_key_value(query_str, "channels", param, sizeof(param)) == ESP_OK) {
        num_channels = atoi(param);
    }
    if (httpd_query_key_value(query_str, "samples", param, sizeof(param)) == ESP_OK) {
        num_samples = atoi(param);
    }

    if (num_channels <= 0 || num_samples <= 0) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid number of channels or samples");
        return ESP_FAIL;
    }

    // Create a JSON object to hold the data
    cJSON *root = cJSON_CreateObject();
    cJSON *data_array = cJSON_CreateArray();

    // Call the data acquisition function (currently generates random data)
    // NOTE: To get real data, replace this function call with your actual data acquisition function.
    get_random_logic_analyzer_data(num_channels, num_samples, data_array);

    cJSON_AddItemToObject(root, "data", data_array);
    
    char *json_string = cJSON_PrintUnformatted(root);
    if (json_string == NULL) {
        ESP_LOGE(TAG, "Failed to create JSON string");
        cJSON_Delete(root);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to create JSON response");
        return ESP_FAIL;
    }

    httpd_resp_set_type(req, "application/json");
    esp_err_t err = httpd_resp_send(req, json_string, HTTPD_RESP_USE_STRLEN);
    
    free(json_string);
    cJSON_Delete(root);

    return err;
}
#endif

static esp_err_t log_error_handler(httpd_req_t *req)
{
    char json_buf[128];
    cJSON *root = set_handler_start(req, json_buf, sizeof(json_buf));
    if (!root) {
        return ESP_FAIL;
    }

    cJSON *message = cJSON_GetObjectItemCaseSensitive(root, "message");
    if (cJSON_IsString(message) && (message->valuestring != NULL)) {
        ESP_LOGE(TAG, "Client-side Error: %s", message->valuestring);
    } else {
        ESP_LOGE(TAG, "Client sent an unreadable error message.");
    }
    
    cJSON_Delete(root);
    
    // Respond to the client to confirm receipt
    httpd_resp_sendstr(req, "Error logged successfully.");

    return ESP_OK;
}

static esp_err_t la_start_capture_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    ESP_LOGI(TAG, "=== la_start_capture_handler() called ===");
    
    // A C-style string buffer to hold the JSON response
    char resp_buf[128];

    // Set flags and call start_capture()
    gbl_capture_started = true;
    gbl_triggered_flag = false;
    gbl_all_captured_flag = false;
    
    ESP_LOGI(TAG, "la_start_capture_handler: Calling start_capture(false)...");
    extern void start_capture(bool without_trigger);
    start_capture(false);
    ESP_LOGI(TAG, "la_start_capture_handler: start_capture() completed");
    
    // Format the JSON string
    // We explicitly return "true" for capture_started because we just called start_capture()
    // and we don't want to rely on gbl_capture_started which might be cleared by the 
    // background thread (race condition).
    snprintf(resp_buf, sizeof(resp_buf), "{\"capture_started\": true, \"triggered\": %s, \"all_captured\": %s}",
             gbl_triggered_flag ? "true" : "false",
             gbl_all_captured_flag? "true" : "false");

    // Set the content type header
    httpd_resp_set_type(req, "application/json");

    // Send the response
    httpd_resp_send(req, resp_buf, HTTPD_RESP_USE_STRLEN);

    ESP_LOGI(TAG, "la_start_capture_handler: Response sent: '%s'", resp_buf);
    return ESP_OK;
}

// ==============================================================================
// TEST AUTOMATION LOGIC (Stubs/Implementation)
// ==============================================================================

static char g_current_test_name[32] = {0};
static char g_test_status[16] = "idle"; // idle, running, done
static char g_test_result_json[512] = "{}";
static bool g_test_is_running = false;

// Stub functions simulating hardware tests
void run_test_input(void) {
    ESP_LOGI(TAG, "Running test_input...");
    vTaskDelay(pdMS_TO_TICKS(1000)); // Simulate test duration
    snprintf(g_test_result_json, sizeof(g_test_result_json), "{\"test\": \"test_input\", \"result\": \"pass\", \"details\": \"Input pins verified\"}");
}

void run_test_output(void) {
    ESP_LOGI(TAG, "Running test_output...");
    vTaskDelay(pdMS_TO_TICKS(1000));
    snprintf(g_test_result_json, sizeof(g_test_result_json), "{\"test\": \"test_output\", \"result\": \"pass\", \"details\": \"Output pins toggled\"}");
}

void run_test_ad(void) {
    ESP_LOGI(TAG, "Running test_ad...");
    vTaskDelay(pdMS_TO_TICKS(1500));
    snprintf(g_test_result_json, sizeof(g_test_result_json), "{\"test\": \"test_ad\", \"result\": \"pass\", \"details\": \"ADC values within range\"}");
}

void run_test_iovoltage(void) {
    ESP_LOGI(TAG, "Running test_iovoltage...");
    vTaskDelay(pdMS_TO_TICKS(500));
    snprintf(g_test_result_json, sizeof(g_test_result_json), "{\"test\": \"test_iovoltage\", \"result\": \"pass\", \"voltage\": \"3.3V\"}");
}

void run_test_uart(void) {
    ESP_LOGI(TAG, "Running test_uart...");
    vTaskDelay(pdMS_TO_TICKS(2000));
    snprintf(g_test_result_json, sizeof(g_test_result_json), "{\"test\": \"test_uart\", \"result\": \"pass\", \"details\": \"Loopback successful\"}");
}

// Task that executes the test
void test_runner_task(void *pvParameters) {
    char *test_name = (char *)pvParameters;

    ESP_LOGI(TAG, "Test runner started for: %s", test_name);
    snprintf(g_test_status, sizeof(g_test_status), "running");

