EZ32Inc/esp32jtag_firmware/main/network/web_server.c
    if (strcmp(test_name, "test_input") == 0) run_test_input();
    else if (strcmp(test_name, "test_output") == 0) run_test_output();
    else if (strcmp(test_name, "test_ad") == 0) run_test_ad();
    else if (strcmp(test_name, "test_iovoltage") == 0) run_test_iovoltage();
    else if (strcmp(test_name, "test_uart") == 0) run_test_uart();
    else {
        ESP_LOGE(TAG, "Unknown test type: %s", test_name);
        snprintf(g_test_result_json, sizeof(g_test_result_json), "{\"test\": \"%s\", \"result\": \"error\", \"details\": \"Unknown test type\"}", test_name);
    }

    snprintf(g_test_status, sizeof(g_test_status), "done");
    g_test_is_running = false;
    free(test_name); // Free the allocated string
    vTaskDelete(NULL);
}

// Handler: /test/start
static esp_err_t test_start_handler(httpd_req_t *req) {
    ESP_LOGI(TAG, "test_start_handler called");
    //if (check_auth(req) != ESP_OK) {
    //    ESP_LOGW(TAG, "check_auth(req) failed");
    //    //return ESP_OK;
    //}

    if (g_test_is_running) {
        ESP_LOGW(TAG, "test_start_handler: Test already running");
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "A test is already running");
        return ESP_FAIL;
    }

    char json_buf[128];
    cJSON *root = set_handler_start(req, json_buf, sizeof(json_buf));
    if (!root) return ESP_FAIL;

    cJSON *test_type_item = cJSON_GetObjectItem(root, "test_type");
    if (!cJSON_IsString(test_type_item) || (test_type_item->valuestring == NULL)) {
        cJSON_Delete(root);
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Missing or invalid 'test_type'");
        return ESP_FAIL;
    }

    // Allocate memory for the test name to pass to the task
    char *test_name_param = strdup(test_type_item->valuestring);
    snprintf(g_current_test_name, sizeof(g_current_test_name), "%s", test_type_item->valuestring);
    cJSON_Delete(root);

    ESP_LOGI(TAG, "Starting test: %s", g_current_test_name);

    g_test_is_running = true;
    xTaskCreate(test_runner_task, "test_runner", 4096, test_name_param, 5, NULL);

    httpd_resp_sendstr(req, "Test started");
    return ESP_OK;
}

// Handler: /test/status
static esp_err_t test_status_handler(httpd_req_t *req) {
    //if (check_auth(req) != ESP_OK) return ESP_OK;

    char resp[128];
    snprintf(resp, sizeof(resp), "{\"status\": \"%s\", \"test\": \"%s\"}", g_test_status, g_current_test_name);

    ESP_LOGI(TAG, "test_status_handler: %s", resp);

    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, resp, HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

// Handler: /test/result
static esp_err_t test_result_handler(httpd_req_t *req) {
    //if (check_auth(req) != ESP_OK) return ESP_OK;

    ESP_LOGI(TAG, "test_result_handler: %s", g_test_result_json);

    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, g_test_result_json, HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

static esp_err_t la_status_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    // Call read_capture_status() to get fresh status
    read_capture_status();
    
    // A C-style string buffer to hold the JSON response
    char resp_buf[128]; 
    
    uint32_t trigger_pos = 128 * gbl_trigger_position / 100;
    if (trigger_pos > 127) {
        trigger_pos = 127;
    }
    trigger_pos = 127 - trigger_pos; // calculate from beginning
    uint32_t trigger_pos_in_samples = 64 * 1024 - trigger_pos * 512 - 14;
    
    // Format the JSON string
    snprintf(resp_buf, sizeof(resp_buf), "{\"triggered\": %s, \"all_captured\": %s, \"wr_addr_stop_position\":%" PRIu32 ", \"trigger_position\":%" PRIu32 "}",
             gbl_triggered_flag ? "true" : "false",
             gbl_all_captured_flag? "true" : "false",
             gbl_wr_addr_stop_position,
             trigger_pos_in_samples);
    
    ESP_LOGI(TAG, "la_status_handler: triggered=%s wr_addr=%d",
             gbl_triggered_flag ? "true" : "false",
             gbl_wr_addr_stop_position);

    // Send the response
    httpd_resp_send(req, resp_buf, HTTPD_RESP_USE_STRLEN);
    
    return ESP_OK;
}

static esp_err_t la_instant_capture_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    ESP_LOGI(TAG, "=== la_instant_capture_handler() called ===");
    
    // 1. Start capture immediately (force trigger)
    start_capture(true);
#if 1    
    // 2. Wait for capture to complete (polling loop)
    ESP_LOGI(TAG, "la_instant_capture_handler: Waiting for capture completion...");
    
    int poll_count = 0;
    while (1) {
        read_capture_status();
        
        if (gbl_triggered_flag) {
            ESP_LOGI(TAG, "la_instant_capture_handler: Capture complete after %d polls", poll_count);
            break;
        }
        
        poll_count++;
        vTaskDelay(pdMS_TO_TICKS(10));
        
        // Safety timeout (~2 seconds)
        if (poll_count > 200) {
            ESP_LOGE(TAG, "la_instant_capture_handler: Timeout waiting for capture");
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Capture timeout");
            return ESP_FAIL;
        }
    }
#endif
    // 3. Read and return data
    ESP_LOGI(TAG, "la_instant_capture_handler: Calling read_and_return_capture()...");
    extern void read_and_return_capture(void);
    read_and_return_capture();
    
    // 4. Send data to browser
    ESP_LOGI(TAG, "la_instant_capture_handler: Sending data...");

    int64_t t_start = esp_timer_get_time();
    esp_err_t ret = httpd_resp_send(req, (const char *)(psram_buffer + CAP_DATA_START), ICE_CAPTURE_BUFFER_SIZE - CAP_DATA_START);
    int64_t t_end = esp_timer_get_time();

    float duration = (float)(t_end - t_start) / 1000000.0f;
    float speed = 0;
    if (duration > 0.000001f) {
        // Megabits per second (Mbps)
        speed = (float)(ICE_CAPTURE_BUFFER_SIZE - CAP_DATA_START) * 8.0f / 1000000.0f / duration;
    }

    ESP_LOGI(TAG, "la_instant_capture_handler: Sent %d bytes in %.3f s. Speed: %.2f mbps",
             (int)(ICE_CAPTURE_BUFFER_SIZE - CAP_DATA_START), duration, speed);
    
    return ret;
}

