EZ32Inc/esp32jtag_firmware/main/network/web_server.c
static esp_err_t la_configure_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    char json_buf[512];
    cJSON *root = set_handler_start(req, json_buf, sizeof(json_buf));
    if (!root) {
        return ESP_FAIL;
    }

    cJSON *sampleRate = cJSON_GetObjectItem(root, "sampleRate");
    cJSON *triggerPosition = cJSON_GetObjectItem(root, "triggerPosition");
    cJSON *triggerEnabled = cJSON_GetObjectItem(root, "triggerEnabled");
    cJSON *triggerModeOR = cJSON_GetObjectItem(root, "triggerModeOR");
    cJSON *captureInternalTestSignal = cJSON_GetObjectItem(root, "captureInternalTestSignal");

    if (sampleRate) {
        gbl_sample_rate = sampleRate->valueint;

        // Map sample rate to register value
        if (gbl_sample_rate >= 264000000) gbl_sample_rate_reg = 255;
        else if (gbl_sample_rate >= 132000000) gbl_sample_rate_reg = 0;
        else if (gbl_sample_rate >= 66000000) gbl_sample_rate_reg = 1;
        else if (gbl_sample_rate >= 33000000) gbl_sample_rate_reg = 2;
        else if (gbl_sample_rate >= 22000000) gbl_sample_rate_reg = 3;
        else if (gbl_sample_rate >= 16500000) gbl_sample_rate_reg = 4;
        else if (gbl_sample_rate >= 11000000) gbl_sample_rate_reg = 6;
        else if (gbl_sample_rate >= 6000000) gbl_sample_rate_reg = 11;
        else if (gbl_sample_rate >= 3000000) gbl_sample_rate_reg = 22;
        else if (gbl_sample_rate >= 2000000) gbl_sample_rate_reg = 33;
        else if (gbl_sample_rate >= 1000000) gbl_sample_rate_reg = 66;
        else if (gbl_sample_rate >= 500000) gbl_sample_rate_reg = 132;
        else gbl_sample_rate_reg = 254; // 0.26MHz

        ESP_LOGI(TAG, "LA Config: Sample Rate = %u, Reg = %u", gbl_sample_rate, gbl_sample_rate_reg);
    }
    if (triggerPosition) {
        gbl_trigger_position = triggerPosition->valueint;
        ESP_LOGI(TAG, "LA Config: Trigger Position = %u%%", gbl_trigger_position);
    }
    if (triggerEnabled) {
        gbl_trigger_enabled = cJSON_IsTrue(triggerEnabled);
        ESP_LOGI(TAG, "LA Config: Trigger Enabled = %s", gbl_trigger_enabled ? "true" : "false");
    }
    if (triggerModeOR) {
        gbl_trigger_mode_or = cJSON_IsTrue(triggerModeOR);
        ESP_LOGI(TAG, "LA Config: Trigger Mode OR = %s", gbl_trigger_mode_or ? "true" : "false");
    }
    if (captureInternalTestSignal) {
        gbl_capture_internal_test_signal = cJSON_IsTrue(captureInternalTestSignal);
        ESP_LOGI(TAG, "LA Config: Capture Internal Test Signal = %s", gbl_capture_internal_test_signal ? "ON" : "OFF");
        set_la_input_sel(gbl_capture_internal_test_signal);
    }

    cJSON *channels = cJSON_GetObjectItem(root, "channels");
    if (channels && cJSON_IsArray(channels)) {
        int array_size = cJSON_GetArraySize(channels);
        for (int i = 0; i < array_size && i < 16; i++) {
            cJSON *item = cJSON_GetArrayItem(channels, i);
            if (cJSON_IsString(item)) {
                if (strcmp(item->valuestring, "disabled") == 0) gbl_channel_triggers[i] = TRIGGER_DISABLED;
                else if (strcmp(item->valuestring, "rising") == 0) gbl_channel_triggers[i] = TRIGGER_RISING;
                else if (strcmp(item->valuestring, "falling") == 0) gbl_channel_triggers[i] = TRIGGER_FALLING;
                else if (strcmp(item->valuestring, "crossing") == 0) gbl_channel_triggers[i] = TRIGGER_CROSSING;
                else if (strcmp(item->valuestring, "high") == 0) gbl_channel_triggers[i] = TRIGGER_HIGH;
                else if (strcmp(item->valuestring, "low") == 0) gbl_channel_triggers[i] = TRIGGER_LOW;
                else gbl_channel_triggers[i] = TRIGGER_DISABLED;
                ESP_LOGI(TAG, "LA Config: CH%d Trigger = %s", i+1, item->valuestring);
            }
        }
    }

    cJSON_Delete(root);

    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, "{\"status\": \"ok\"}");

    return ESP_OK;
}

static esp_err_t la_get_settings_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;

    const char *trigger_names[] = {"disabled", "rising", "falling", "crossing", "high", "low"};

    cJSON *root = cJSON_CreateObject();
    cJSON_AddNumberToObject(root, "sampleRate",    gbl_sample_rate);
    cJSON_AddBoolToObject  (root, "triggerEnabled", gbl_trigger_enabled);
    cJSON_AddBoolToObject  (root, "triggerModeOR",  gbl_trigger_mode_or);
    cJSON_AddBoolToObject  (root, "captureInternalTestSignal", gbl_capture_internal_test_signal);
    cJSON_AddNumberToObject(root, "triggerPosition", gbl_trigger_position);

    cJSON *channels = cJSON_CreateArray();
    for (int i = 0; i < 16; i++) {
        int t = (int)gbl_channel_triggers[i];
        const char *name = (t >= 0 && t <= 5) ? trigger_names[t] : "disabled";
        cJSON_AddItemToArray(channels, cJSON_CreateString(name));
    }
    cJSON_AddItemToObject(root, "channels", channels);

    char *json_str = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);

    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, json_str, HTTPD_RESP_USE_STRLEN);
    free(json_str);

    return ESP_OK;
}

static esp_err_t version_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;

    const esp_app_desc_t *app = esp_app_get_description();

    cJSON *root = cJSON_CreateObject();
    cJSON_AddStringToObject(root, "project_name",          app->project_name);
    cJSON_AddStringToObject(root, "firmware_version",      app->version);
    cJSON_AddStringToObject(root, "hardware_version",      HW_VERSION);
    cJSON_AddStringToObject(root, "idf_version",           app->idf_ver);
    cJSON_AddStringToObject(root, "build_date",            app->date);
    cJSON_AddStringToObject(root, "build_time",            app->time);
    cJSON_AddStringToObject(root, "main_git_commit",       MAIN_GIT_COMMIT);
    cJSON_AddStringToObject(root, "blackmagic_git_commit", FIRMWARE_VERSION);

    char *json_str = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);

    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, json_str);
    free(json_str);

    return ESP_OK;
}

esp_err_t reset_to_factory_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;

    ESP_LOGW(TAG, "Factory Reset Initialized by User");

