EZ32Inc/esp32jtag_firmware/main/network/web_server.c
    storage_erase_key(PORT_A_CFG_KEY);
    storage_erase_key(PORT_B_CFG_KEY);
    storage_erase_key(PORT_C_CFG_KEY);
    storage_erase_key(PORT_D_CFG_KEY);
    storage_erase_key(TARGET_VOLTAGE_KEY);
    storage_erase_key(SW_MCU_KEY);
    storage_erase_key(WIFI_MODE_KEY);
    storage_erase_key(WIFI_SSID_KEY);
    storage_erase_key(WIFI_PASS_KEY);
    storage_erase_key(WIFI_AP_SSID_KEY);
    storage_erase_key(WIFI_AP_PASS_KEY);
    storage_erase_key(OTA_URL_KEY);
    storage_erase_key(MCU_INTERFACE_KEY);
    
    // Also erase web credentials so it defaults to admin:admin
    storage_erase_key(WEB_USER_KEY);
    storage_erase_key(WEB_PASS_KEY);

    // Erase UART settings
    storage_erase_key(UART_BAUD_KEY);
    storage_erase_key(UART_DATA_BITS_KEY);
    storage_erase_key(UART_STOP_BITS_KEY);
    storage_erase_key(UART_PARITY_KEY);
    storage_erase_key(UART_PORT_SEL_KEY);
    storage_erase_key(DISABLE_USB_DAP_KEY);

    httpd_resp_sendstr(req, "Factory reset complete. Rebooting...");
    vTaskDelay(3000 / portTICK_PERIOD_MS);
    esp_restart();
    return ESP_OK;
}

httpd_uri_t uri_reset_to_factory = {
    .uri       = "/reset_to_factory",
    .method    = HTTP_POST,
    .handler   = reset_to_factory_handler,
    .user_ctx  = NULL
};

httpd_uri_t uri_ota_upload = {
    .uri      = "/ota_upload",
    .method   = HTTP_POST,
#ifndef FPGA_CFG_TEST 
    .handler  = ota_upload_handler,
#else
    .handler  = fpga_loader_handler,
#endif
    .user_ctx = NULL
};

httpd_uri_t uri_get_main_page = {
    .uri = "/",
    .method = HTTP_GET,
    .handler = website_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_get_logo = {
    .uri = "/ez32.svg",
    .method = HTTP_GET,
    .handler = ez32_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_get_favicon = {
    .uri = "/favicon.ico",
    .method = HTTP_GET,
    .handler = favicon_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_set_credentials = {
    .uri = "/set_credentials",
    .method = HTTP_POST,
    .handler = set_credentials_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_get_credentials = {
    .uri = "/get_credentials",
    .method = HTTP_GET,
    .handler = get_credentials_handler,
    .user_ctx = NULL
};


httpd_uri_t uri_file_upload = {
    .uri       = "/upload/*",
    .method    = HTTP_POST,
    .handler   = file_upload_handler,
    .user_ctx  = NULL
};

httpd_uri_t uri_file_delete = {
    .uri       = "/delete/*",
    .method    = HTTP_POST,
    .handler   = file_delete_handler,
    .user_ctx  = NULL
};

httpd_uri_t uri_logic_analyzer = {
    .uri = "/logic_analyzer.html",
    .method = HTTP_GET,
    .handler = logic_analyzer_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_help = {
    .uri = "/help",
    .method = HTTP_GET,
    .handler = help_handler,
    .user_ctx = NULL
};
/*
httpd_uri_t uri_logic_analyzer_data = {
    .uri = "/logic_analyzer_data",
    .method = HTTP_GET,
    .handler = logic_analyzer_data_handler,
    .user_ctx = NULL
};
*/
httpd_uri_t uri_log_error = {
    .uri = "/log_error",
    .method = HTTP_POST,
    .handler = log_error_handler,
    .user_ctx = NULL
};

esp_err_t not_found_handler(httpd_req_t *req, httpd_err_code_t err_code)
{
    httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "The requested URI was not found on this server.");
    return ESP_OK;
}

httpd_uri_t uri_capture_data= {
    .uri = "/capture_data",
    .method = HTTP_GET,
    .handler = capture_data_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_status = {
    .uri      = "/la_status",
    .method   = HTTP_GET,
    .handler  = la_status_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_instant_capture = {
    .uri      = "/instant_capture",
    .method   = HTTP_GET,
    .handler  = la_instant_capture_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_start_capture = {
    .uri      = "/la_start_capture",
    .method   = HTTP_GET,
    .handler  = la_start_capture_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_configure = {
    .uri      = "/la_configure",
    .method   = HTTP_POST,
    .handler  = la_configure_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_get_settings = {
    .uri      = "/la_get_settings",
    .method   = HTTP_GET,
    .handler  = la_get_settings_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_version = {
    .uri      = "/api/version",
    .method   = HTTP_GET,
    .handler  = version_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_test_start = {
    .uri      = "/test/start",
    .method   = HTTP_POST,
    .handler  = test_start_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_test_status = {
    .uri      = "/test/status",
    .method   = HTTP_GET,
    .handler  = test_status_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_test_result = {
    .uri      = "/test/result",
    .method   = HTTP_GET,
    .handler  = test_result_handler,
    .user_ctx = NULL
};

#include "esp_https_server.h"

extern const unsigned char cacert_pem_start[] asm("_binary_cacert_pem_start");
extern const unsigned char cacert_pem_end[]   asm("_binary_cacert_pem_end");
extern const unsigned char prvtkey_pem_start[] asm("_binary_prvtkey_pem_start");
extern const unsigned char prvtkey_pem_end[]   asm("_binary_prvtkey_pem_end");

esp_err_t web_server_start(httpd_handle_t *http_handle) {
    httpd_ssl_config_t config = HTTPD_SSL_CONFIG_DEFAULT();

    // Note: mbedtls requires PEM to be null-terminated. Embedded files might not be.
    // We allocate a buffer, copy, and adhere to requirements.
    
    size_t cacert_len = cacert_pem_end - cacert_pem_start;
    size_t prvtkey_len = prvtkey_pem_end - prvtkey_pem_start;

    // Allocate buffers with space for \0
    uint8_t *cacert_buf = calloc(1, cacert_len + 1);
    uint8_t *prvtkey_buf = calloc(1, prvtkey_len + 1);

    if (!cacert_buf || !prvtkey_buf) {
        ESP_LOGE(TAG, "Failed to allocate memory for SSL certs");
        free(cacert_buf);
        free(prvtkey_buf);
        return ESP_ERR_NO_MEM;
    }

    memcpy(cacert_buf, cacert_pem_start, cacert_len);
    cacert_buf[cacert_len] = '\0';

