EZ32Inc/esp32jtag_firmware/main/network/web_server.c
    memcpy(prvtkey_buf, prvtkey_pem_start, prvtkey_len);
    prvtkey_buf[prvtkey_len] = '\0';

    config.servercert = cacert_buf;
    config.servercert_len = cacert_len + 1; // Include null terminator
    config.prvtkey_pem = prvtkey_buf;
    config.prvtkey_len = prvtkey_len + 1; // Include null terminator

    config.httpd.max_uri_handlers = 30;
    config.httpd.stack_size = 10240; // Increased stack for SSL operations

    ESP_LOGI(TAG, "Starting HTTPS Server on port: '%d'", config.httpd.server_port);
    esp_err_t ret = httpd_ssl_start(http_handle, &config);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start web server! Error: %d", ret);
    }

    httpd_register_uri_handler(*http_handle, &uri_get_main_page);
    httpd_register_uri_handler(*http_handle, &uri_get_logo);
    httpd_register_uri_handler(*http_handle, &uri_get_favicon);
    httpd_register_uri_handler(*http_handle, &uri_set_credentials);
    httpd_register_uri_handler(*http_handle, &uri_get_credentials);
    httpd_register_uri_handler(*http_handle, &uri_file_upload);
    httpd_register_uri_handler(*http_handle, &uri_file_delete);
    httpd_register_uri_handler(*http_handle, &uri_logic_analyzer);
    httpd_register_uri_handler(*http_handle, &uri_help);
    //httpd_register_uri_handler(*http_handle, &uri_logic_analyzer_data);
    httpd_register_uri_handler(*http_handle, &uri_log_error);
    httpd_register_uri_handler(*http_handle, &uri_ota_upload);
    httpd_register_uri_handler(*http_handle, &uri_reset_to_factory);

    httpd_register_err_handler(*http_handle, HTTPD_404_NOT_FOUND, not_found_handler);
    ESP_ERROR_CHECK(uart_websocket_add_handlers(*http_handle));

    httpd_register_uri_handler(*http_handle, &uri_la_start_capture);
    httpd_register_uri_handler(*http_handle, &uri_la_status);
    httpd_register_uri_handler(*http_handle, &uri_la_instant_capture);
    httpd_register_uri_handler(*http_handle, &uri_capture_data);
    httpd_register_uri_handler(*http_handle, &uri_la_configure);
    httpd_register_uri_handler(*http_handle, &uri_la_get_settings);
    httpd_register_uri_handler(*http_handle, &uri_version);

    // Test automation endpoints
    httpd_register_uri_handler(*http_handle, &uri_test_start);
    httpd_register_uri_handler(*http_handle, &uri_test_status);
    httpd_register_uri_handler(*http_handle, &uri_test_result);
    
    // We cannot free the buffers here if httpd_ssl_start uses them by reference!
    // Documentation for httpd_ssl_start isn't explicit if it copies.
    // However, usually mbedtls parses it into its own context.
    // BUT httpd server keeps the config struct?
    // Actually, checking standard implementation: httpd_ssl_start creates a session and usually the context persists.
    // If we free it, and it accessed it later (e.g. for new connections/re-handshake), crash.
    // Given this is the global web server, leaking 2-3KB once is acceptable vs crashing.
    // So we do NOT free them.
    
    return ret;
}
